app/Controllers/Admin/PembayaranController.php

SELECT `pembayaran`.*, `pemesanan`.`no_invoice`, `pelanggan`.`nama`
FROM `pembayaran`
JOIN `pemesanan` ON `pemesanan`.`id_pemesanan` = `pembayaran`.`id_pemesanan`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pemesanan`.`id_pelanggan`
ORDER BY `tanggal_bayar` DESC
---
    public function index()
    {
        $data['pembayaran'] =
        $this->PembayaranModel
        ->select(
            'pembayaran.*,
            pemesanan.no_invoice,
            pelanggan.nama'
        )
        ->join(
            'pemesanan',
            'pemesanan.id_pemesanan = pembayaran.id_pemesanan'
        )
        ->join(
            'pelanggan',
            'pelanggan.id_pelanggan = pemesanan.id_pelanggan'
        )
        ->orderBy(
            'tanggal_bayar',
            'DESC'
        )
        ->findAll();