app/Controllers/Pelanggan/Catering.php

SELECT *
FROM `paket`
---
    public function index()
    {
        $data['paket'] = $this->PaketModel->findAll();

SELECT *
FROM `pemesanan`
WHERE `pemesanan`.`id_pemesanan` = '22'
---

    $idPemesanan = $this->PemesananModel->getInsertID();

$pemesanan = $this->PemesananModel->find($idPemesanan);

INSERT INTO `pembayaran` (`id_pemesanan`, `jenis_pembayaran`, `metode_pembayaran`, `nominal`) VALUES ('22', 'DP', 'Transfer', '150000')
SELECT *
FROM `pemesanan`
WHERE `pemesanan`.`id_pemesanan` = '22'
UPDATE `pemesanan` SET `total_terbayar` = '150000', `sisa_pembayaran` = 150000, `status_pembayaran` = 'DP', `status_pesanan` = 'Diproses'
WHERE `pemesanan`.`id_pemesanan` IN ('22')
---
public function prosesDP()
{
    $idPemesanan = $this->request->getPost('id_pemesanan');

    $nominal = $this->request->getPost('nominal');

    $metode = $this->request->getPost('metode_pembayaran');

    $this->PembayaranModel->insert([
        'id_pemesanan'       => $idPemesanan,
        'jenis_pembayaran'   => 'DP',
        'metode_pembayaran'  => $metode,
        'nominal'            => $nominal
    ]);

    $pemesanan = $this->PemesananModel->find($idPemesanan);

    $this->PemesananModel
    ->update($idPemesanan, [

        'total_terbayar' =>
            $nominal,

        'sisa_pembayaran' =>
            $pemesanan['total_tagihan'] - $nominal,

        'status_pembayaran' =>
            'DP',

        'status_pesanan' =>
            'Diproses'

    ]);

SELECT *
FROM `paket`
WHERE `paket`.`id_paket` = '2'
INSERT INTO `pemesanan` (`id_pelanggan`, `no_invoice`, `tanggal_acara`, `alamat_acara`, `total_tagihan`, `total_terbayar`, `sisa_pembayaran`, `status_pembayaran`, `status_pesanan`) VALUES ('3', 'INV20260612023914', '2026-06-16', 'Medan', 300000, 0, 300000, 'Belum Bayar', 'Menunggu DP')
---
public function prosesCheckout()
{
    $keranjang = session()->get('keranjang') ?? [];

    $tanggalAcara = $this->request->getPost('tanggal_acara');
    $alamatAcara  = $this->request->getPost('alamat_acara');

    $totalTagihan = 0;

    foreach ($keranjang as $item)
    {
        $paket = $this->PaketModel
            ->find($item['id_paket']);

        $totalTagihan +=
            ($paket['harga_porsi'] *
             $item['jumlah_porsi']);
    }

    $invoice = 'INV' . date('YmdHis');

    $this->PemesananModel->insert([
        'id_pelanggan' => session()->get('id_pelanggan'),
        'no_invoice' => $invoice,
        'tanggal_acara' => $tanggalAcara,
        'alamat_acara' => $alamatAcara,
        'total_tagihan' => $totalTagihan,
        'total_terbayar' => 0,
        'sisa_pembayaran' => $totalTagihan,
        'status_pembayaran' => 'Belum Bayar',
        'status_pesanan' => 'Menunggu DP'
    ]);

INSERT INTO `detail_pemesanan` (`id_pemesanan`, `id_paket`, `jumlah_porsi`, `id_menu`) VALUES (22, '2', '20', '4')
---
    {
        foreach ($item['menu'] as $idMenu)
        {
            $this->DetailPemesananModel->insert([
                'id_pemesanan' => $idPemesanan,
                'id_paket' => $item['id_paket'],
                'jumlah_porsi' => $item['jumlah_porsi'],
                'id_menu' => $idMenu
            ]);

SELECT *
FROM `pemesanan`
WHERE `id_pelanggan` = '2'
ORDER BY `id_pemesanan` DESC
---
public function pesananSaya()
{
    $pesanan = $this->PemesananModel
        ->where('id_pelanggan', session()->get('id_pelanggan'))
        ->orderBy('id_pemesanan', 'DESC')
        ->findAll();