app/Controllers/Pelanggan/DashboardController.php

    public function index()
    {
       $idPelanggan = session()->get('id_pelanggan');// nanti ganti session login

        $data['notifPelunasan'] =
            $this->PemesananModel
            ->where('id_pelanggan', $idPelanggan)
            ->where('status_pesanan', 'Selesai')
            ->where('status_pembayaran', 'DP')
            ->countAllResults();

        $data['totalPesanan'] =
            $this->PemesananModel
            ->where('id_pelanggan', $idPelanggan)
            ->countAllResults();

        $data['pesananDP'] =
            $this->PemesananModel
            ->where('id_pelanggan', $idPelanggan)
            ->where('status_pembayaran', 'DP')
            ->countAllResults();

        $data['pesananLunas'] =
            $this->PemesananModel
            ->where('id_pelanggan', $idPelanggan)
            ->where('status_pembayaran', 'Lunas')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `id_pelanggan` = '2'
AND `status_pesanan` = 'Selesai'
AND `status_pembayaran` = 'DP'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `id_pelanggan` = '2'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `id_pelanggan` = '2'
AND `status_pembayaran` = 'DP'
SELECT COUNT(*) AS `numrows`
FROM `pemesanan`
WHERE `id_pelanggan` = '2'
AND `status_pembayaran` = 'Lunas'