app/Controllers/Pelanggan/ProfilController.php

    public function index()
    {
        $idPelanggan =
            session()->get('id_pelanggan');

        $data['pelanggan'] =
            $this->PelangganModel->find(
                $idPelanggan
            );
---
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id_pelanggan` = '2'

    public function update()
    {
        $idPelanggan =
            session()->get('id_pelanggan');

        $this->PelangganModel->update(
            $idPelanggan,
            [

                'nama' =>
                    $this->request->getPost('nama'),

                'no_hp' =>
                    $this->request->getPost('no_hp'),

                'alamat' =>
                    $this->request->getPost('alamat')

            ]
        );
---
UPDATE `pelanggan` SET `nama` = 'Ami', `no_hp` = '08345678990', `alamat` = 'Medan'
WHERE `pelanggan`.`id_pelanggan` IN ('2')