app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'zaza12'
 LIMIT 1
---
   public function prosesLogin()
{
$username = $this->request->getPost('username');
$password = $this->request->getPost('password');

$user = $this->UserModel
    ->where('username', $username)
    ->first();

SELECT *
FROM `pelanggan`
WHERE `id_user` = '4'
 LIMIT 1
---
// Login pelanggan
if ($user['role'] == 'pelanggan')
{
    $pelanggan = $this->PelangganModel
        ->where(
            'id_user',
            $user['id_user']
        )
        ->first();